{"data":{"site":{"siteMetadata":{"title":"Codycrunch","author":"NicoAudy"}},"markdownRemark":{"id":"37fa2359-fe97-5322-b263-21a0df68c2c2","html":"<hr>\n<p>Developers should always be interested and curious about what other developers do to make their daily work as pleasant as possible.</p>\n<p>This is what we all want and what we should care about. Developers are lazy and very clever at the same time. We’re able to customize our environment to make it work in a way we want it to work. We spend a lot of time in thinking about how to automate repetitive tasks because we don’t want to repeat ourself over and over again. We try to make things with as less effort as possible to get as much things as possible done. We don’t want to waste time. We want to be productive.</p>\n<p>For me Vim is a wall. But you also see, once you climbed that wall, you can lean back and slide down on the other side. So what do I try to say with this relatively lovely figure of Vim’s learning curve wall?</p>\n<p>️Well, yes. It is true that it’s really hard to get started with this. You have to learn a bunch of key bindings, you even have to stick with a textual user interface. However, once you learned the fundamentals of Vim you’ll notice that the original idea behind this editor is actually quite clever and that you’re probably much faster than before.</p>\n<p>You don’t need a mouse, you push yourself to use as few key strokes as possible to do your operations (which again makes you faster), you learn how to customize the entire editor that it fits to your preferences and you finally become a Vim power user and only leave it when it’s really needed.</p>\n<p>I climbed that wall and it took me weeks to get used to the basic things like editing files, opening different files etc. Back in the days I switched from <code class=\"language-text\">PhpStorm</code> to Vim. You probably agree that this IDE is slow by default. But despite from that, once I was able to do some basic operations in Vim and actually started working again, I made almost as twice as much progress at work in about half the time. I know that sounds kind of crazy but I’m serious. And that convinced me that I made the right choice.</p>\n<h3 id=\"so-do-yourself-a-favor-and-climb-that-mountain-just-remember-that-you-can-slide-down-afterwards\"><a href=\"#so-do-yourself-a-favor-and-climb-that-mountain-just-remember-that-you-can-slide-down-afterwards\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a><code class=\"language-text\">So, do yourself a favor and climb that mountain. Just remember that you can slide down afterwards.</code></h3>\n<p>Vim gives you literally a grammar so that you can edit your text with the speed of thought. <code class=\"language-text\">There&#39;s no place like Vim</code> , please try :D ..</p>","timeToRead":2,"frontmatter":{"title":"Why Vim ?","date":"May 04, 2019","spoiler":"Saya pertama kali mencoba vim ditahun 2015 hingga sekarang, this is why.."},"fields":{"slug":"/why-vim/","langKey":"en"}}},"pageContext":{"slug":"/why-vim/","previous":{"fields":{"slug":"/laravel-trick/","langKey":"en","directoryName":"laravel-trick","maybeAbsoluteLinks":[]},"frontmatter":{"title":"Laravel Tricks"}},"next":null,"translations":[],"translatedLinks":[]}}